Revit 2027 API
ParameterTypeId.GenericDepth Property
 "Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GenericDepth { get; }
Public Shared ReadOnly Property GenericDepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GenericDepth {
	ForgeTypeId^ get ();
}
static member GenericDepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace